Tutorial/20230524053313-git_tricks.org
:PROPERTIES:
:ID:       633b4d18-e9b5-4e08-bf98-5b36959625fd
:END:
#+TITLE: git tricks
#+CREATED: [2023-05-24 Wed 05:33]
#+LAST_MODIFIED: [2023-05-24 Wed 05:35]
* Git tricks
This is a list of git tricks that you may or maynot need one day


** Pulling Down only a few files from a large repo
Smetimes on github you can find very large repos holding packaging data for stuff like pypi.

Clone the repo, do not checkout files
#+begin_src shell
git clone --depth 1 --no-checkout --filter=blob:none <repo>
#+end_src

Check the files and stuff we want.
#+begin_src shell
git checkout master -- file1 file2
#+end_src
